MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX570F512L.PIC
      <edc:SFRDef edc:_addr="0x1F80FA1C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPINRx.Module" edc:_refcount="6" edc:access="----------------------------nnnn" edc:cname="T3CKR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="T3CKR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T3CKR" edc:desc="" edc:mask="0xf" edc:name="T3CKR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA20" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPINRx.Module" edc:_refcount="7" edc:access="----------------------------nnnn" edc:cname="T4CKR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="T4CKR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T4CKR" edc:desc="" edc:mask="0xf" edc:name="T4CKR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA24" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPINRx.Module" edc:_refcount="8" edc:access="----------------------------nnnn" edc:cname="T5CKR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="T5CKR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T5CKR" edc:desc="" edc:mask="0xf" edc:name="T5CKR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA28" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPINRx.Module" edc:_refcount="9" edc:access="----------------------------nnnn" edc:cname="IC1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC1R" edc:desc="" edc:mask="0xf" edc:name="IC1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA2C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPINRx.Module" edc:_refcount="10" edc:access="----------------------------nnnn" edc:cname="IC2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC2R" edc:desc="" edc:mask="0xf" edc:name="IC2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA30" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPINRx.Module" edc:_refcount="11" edc:access="----------------------------nnnn" edc:cname="IC3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC3R" edc:desc="" edc:mask="0xf" edc:name="IC3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA34" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPINRx.Module" edc:_refcount="12" edc:access="----------------------------nnnn" edc:cname="IC4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC4R" edc:desc="" edc:mask="0xf" edc:name="IC4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA38" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPINRx.Module" edc:_refcount="13" edc:access="----------------------------nnnn" edc:cname="IC5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC5R" edc:desc="" edc:mask="0xf" edc:name="IC5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
