MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX570F512L.PIC
      <edc:SFRDef edc:_addr="0x1F881050" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-02495_TRAN_int_evic.Module" edc:_refcount="1" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="IFS2" edc:desc="" edc:grp="INT" edc:impl="0x000fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="IFS2" edc:nzwidth="0x20" edc:por="------------00000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3TXIF" edc:desc="" edc:mask="0x1" edc:name="U3TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U4EIF" edc:desc="" edc:mask="0x1" edc:name="U4EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U4RXIF" edc:desc="" edc:mask="0x1" edc:name="U4RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U4TXIF" edc:desc="" edc:mask="0x1" edc:name="U4TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U5EIF" edc:desc="" edc:mask="0x1" edc:name="U5EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U5RXIF" edc:desc="" edc:mask="0x1" edc:name="U5RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U5TXIF" edc:desc="" edc:mask="0x1" edc:name="U5TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTMUIF" edc:desc="" edc:mask="0x1" edc:name="CTMUIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA0IF" edc:desc="" edc:mask="0x1" edc:name="DMA0IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA1IF" edc:desc="" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA2IF" edc:desc="" edc:mask="0x1" edc:name="DMA2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA3IF" edc:desc="" edc:mask="0x1" edc:name="DMA3IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP3IF" edc:desc="" edc:mask="0x1" edc:name="CMP3IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN1IF" edc:desc="" edc:mask="0x1" edc:name="CAN1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3EIF" edc:desc="" edc:mask="0x1" edc:name="SPI3EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI3RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI3TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4EIF" edc:desc="" edc:mask="0x1" edc:name="SPI4EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI4RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI4TXIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881060" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-02495_TRAN_int_evic.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC0" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000x0000x0000x0000000000000000" edc:name="IEC0" edc:nzwidth="0x20" edc:por="00000x0000x0000x0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIE" edc:desc="" edc:mask="0x1" edc:name="CTIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS0IE" edc:desc="" edc:mask="0x1" edc:name="CS0IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS1IE" edc:desc="" edc:mask="0x1" edc:name="CS1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT0IE" edc:desc="" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T1IE" edc:desc="" edc:mask="0x1" edc:name="T1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC1EIE" edc:desc="" edc:mask="0x1" edc:name="IC1EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC1IE" edc:desc="" edc:mask="0x1" edc:name="IC1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC1IE" edc:desc="" edc:mask="0x1" edc:name="OC1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT1IE" edc:desc="" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T2IE" edc:desc="" edc:mask="0x1" edc:name="T2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC2EIE" edc:desc="" edc:mask="0x1" edc:name="IC2EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC2IE" edc:desc="" edc:mask="0x1" edc:name="IC2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC2IE" edc:desc="" edc:mask="0x1" edc:name="OC2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT2IE" edc:desc="" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T3IE" edc:desc="" edc:mask="0x1" edc:name="T3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC3EIE" edc:desc="" edc:mask="0x1" edc:name="IC3EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC3IE" edc:desc="" edc:mask="0x1" edc:name="IC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IE" edc:desc="" edc:mask="0x1" edc:name="OC3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT3IE" edc:desc="" edc:mask="0x1" edc:name="INT3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T4IE" edc:desc="" edc:mask="0x1" edc:name="T4IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC4EIE" edc:desc="" edc:mask="0x1" edc:name="IC4EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC4IE" edc:desc="" edc:mask="0x1" edc:name="IC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IE" edc:desc="" edc:mask="0x1" edc:name="OC4IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT4IE" edc:desc="" edc:mask="0x1" edc:name="INT4IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T5IE" edc:desc="" edc:mask="0x1" edc:name="T5IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC5EIE" edc:desc="" edc:mask="0x1" edc:name="IC5EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC5IE" edc:desc="" edc:mask="0x1" edc:name="IC5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5IE" edc:desc="" edc:mask="0x1" edc:name="OC5IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1IE" edc:desc="" edc:mask="0x1" edc:name="AD1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSCMIE" edc:desc="" edc:mask="0x1" edc:name="FSCMIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCCIE" edc:desc="" edc:mask="0x1" edc:name="RTCCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCEIE" edc:desc="" edc:mask="0x1" edc:name="FCEIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881070" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-02495_TRAN_int_evic.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC1" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxx-0xxxx-0000000000000000000" edc:name="IEC1" edc:nzwidth="0x20" edc:por="xxxxxx-0xxxx-0000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1IE" edc:desc="" edc:mask="0x1" edc:name="CMP1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2IE" edc:desc="" edc:mask="0x1" edc:name="CMP2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBIE" edc:desc="" edc:mask="0x1" edc:name="USBIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIE" edc:desc="" edc:mask="0x1" edc:name="SPI1EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1EIE" edc:desc="" edc:mask="0x1" edc:name="U1EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1RXIE" edc:desc="" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1TXIE" edc:desc="" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIE" edc:desc="" edc:mask="0x1" edc:name="I2C1BIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIE" edc:desc="" edc:mask="0x1" edc:name="I2C1SIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIE" edc:desc="" edc:mask="0x1" edc:name="I2C1MIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNAIE" edc:desc="" edc:mask="0x1" edc:name="CNAIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNBIE" edc:desc="" edc:mask="0x1" edc:name="CNBIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNCIE" edc:desc="" edc:mask="0x1" edc:name="CNCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNDIE" edc:desc="" edc:mask="0x1" edc:name="CNDIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEIE" edc:desc="" edc:mask="0x1" edc:name="CNEIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFIE" edc:desc="" edc:mask="0x1" edc:name="CNFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNGIE" edc:desc="" edc:mask="0x1" edc:name="CNGIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMPIE" edc:desc="" edc:mask="0x1" edc:name="PMPIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMPEIE" edc:desc="" edc:mask="0x1" edc:name="PMPEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2EIE" edc:desc="" edc:mask="0x1" edc:name="SPI2EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2EIE" edc:desc="" edc:mask="0x1" edc:name="U2EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2RXIE" edc:desc="" edc:mask="0x1" edc:name="U2RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2TXIE" edc:desc="" edc:mask="0x1" edc:name="U2TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2BIE" edc:desc="" edc:mask="0x1" edc:name="I2C2BIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIE" edc:desc="" edc:mask="0x1" edc:name="I2C2SIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIE" edc:desc="" edc:mask="0x1" edc:name="I2C2MIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3EIE" edc:desc="" edc:mask="0x1" edc:name="U3EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3RXIE" edc:desc="" edc:mask="0x1" edc:name="U3RXIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881080" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-02495_TRAN_int_evic.Module" edc:_refcount="1" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="IEC2" edc:desc="" edc:grp="INT" edc:impl="0x000fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="IEC2" edc:nzwidth="0x20" edc:por="------------00000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3TXIE" edc:desc="" edc:mask="0x1" edc:name="U3TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U4EIE" edc:desc="" edc:mask="0x1" edc:name="U4EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U4RXIE" edc:desc="" edc:mask="0x1" edc:name="U4RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U4TXIE" edc:desc="" edc:mask="0x1" edc:name="U4TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U5EIE" edc:desc="" edc:mask="0x1" edc:name="U5EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U5RXIE" edc:desc="" edc:mask="0x1" edc:name="U5RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U5TXIE" edc:desc="" edc:mask="0x1" edc:name="U5TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTMUIE" edc:desc="" edc:mask="0x1" edc:name="CTMUIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA0IE" edc:desc="" edc:mask="0x1" edc:name="DMA0IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA1IE" edc:desc="" edc:mask="0x1" edc:name="DMA1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA2IE" edc:desc="" edc:mask="0x1" edc:name="DMA2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA3IE" edc:desc="" edc:mask="0x1" edc:name="DMA3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP3IE" edc:desc="" edc:mask="0x1" edc:name="CMP3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN1IE" edc:desc="" edc:mask="0x1" edc:name="CAN1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3EIE" edc:desc="" edc:mask="0x1" edc:name="SPI3EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI3RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI3TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4EIE" edc:desc="" edc:mask="0x1" edc:name="SPI4EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI4RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI4TXIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881090" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-02495_TRAN_int_evic.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC0" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC0" edc:nzwidth="0x20" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIS" edc:desc="" edc:mask="0x3" edc:name="CTIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CTIP" edc:desc="" edc:mask="0x7" edc:name="CTIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CS0IS" edc:desc="" edc:mask="0x3" edc:name="CS0IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CS0IP" edc:desc="" edc:mask="0x7" edc:name="CS0IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CS1IS" edc:desc="" edc:mask="0x3" edc:name="CS1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CS1IP" edc:desc="" edc:mask="0x7" edc:name="CS1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT0IS" edc:desc="" edc:mask="0x3" edc:name="INT0IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="INT0IP" edc:desc="" edc:mask="0x7" edc:name="INT0IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8810A0" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-02495_TRAN_int_evic.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC1" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC1" edc:nzwidth="0x20" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T1IS" edc:desc="" edc:mask="0x3" edc:name="T1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="T1IP" edc:desc="" edc:mask="0x7" edc:name="T1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC1IS" edc:desc="" edc:mask="0x3" edc:name="IC1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="IC1IP" edc:desc="" edc:mask="0x7" edc:name="IC1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC1IS" edc:desc="" edc:mask="0x3" edc:name="OC1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="OC1IP" edc:desc="" edc:mask="0x7" edc:name="OC1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT1IS" edc:desc="" edc:mask="0x3" edc:name="INT1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="INT1IP" edc:desc="" edc:mask="0x7" edc:name="INT1IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
